# ინტერნეტი არის კომუნიკაციის საშუალება, რომელიც პირველად გამოიყენეს 1965 წელს ინფორმაციის გადაცემის მიზნით. ინტერნეტი გამოიგონა იმ ხალხმა, რომელსაც უნდოდათ გადაეცათ მნიშვნელოვანი ინფორმაცია შორს სწრაფი სიჩქარით და გაურღვეველად.
#1990 წელს ბრიტანელმა მეცნიერმა გამოიგონა World Wide Web (WWW), რომელმაც მისცა ყველას საშუალება გამოეყენებინათ ინტერნეტი არა მხოლოდ კომუნიკაციისათვის, მაგალითად Wikipedia, რომელსაც აქვს უამრავი ინფორმაცია თითქმის ყველაფრის შესახებ.
#2000 წლიდან ინტერნეტი არის ერთ-ერთი ყველაზე საჭირო რამ დღევანდელი ცხოვრებისთვის, მას ვიყენებთ ყიდვისთვის, სამუშაოდ, ფილმების ან სერიალების ყურებისთვის და ა.შ.
#2010 წელს პირველად გამოიგონეს ხელოვნური ინტელექტი (AI), რომელსაც შეუძლია ყველაფრის გააზრება და დავალებების შესრულება, რომელიც ვფიქრობ რომ სამწუხაროდ ერთ დღესაც ადამიანობას ჩაანაცვლებს.



#ვებ სერვერი არის პროგრამული აპლიკაცია, რომელიც ინახავს, ​​ამუშავებს და ემსახურება ვებ შიგთავსს მომხმარებლებს ინტერნეტით. ის უსმენს ვებ-ბრაუზერების ან სხვა კლიენტების თხოვნებს და პასუხობს ვებგვერდებისა და სხვა რესურსების მიწოდებით.